src/cf/Catalogs/CRM_ПрограммыMSOutlook.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ПрограммыMSOutlook</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииКонтактов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииПисем</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииСобытий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаGUID</Name>
					<Comment>Длина GUID</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_ПрограммыMSOutlook/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПоследнейСинхронизацииКонтактов	= Объект.ДатаПоследнейСинхронизацииКонтактов;
	ДатаПоследнейСинхронизацииСобытий	= Объект.ДатаПоследнейСинхронизацииСобытий;
	ДатаПоследнейСинхронизацииПисем		= Объект.ДатаПоследнейСинхронизацииПисем;
	Если  НЕ ЗначениеЗаполнено(ДатаПоследнейСинхронизацииКонтактов) 
		И НЕ ЗначениеЗаполнено(ДатаПоследнейСинхронизацииСобытий) Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			НадписьДатаСинхронизации = "";
		Иначе
			НадписьДатаСинхронизации = НСтр("ru = 'Обмен не выполнен'");
		КонецЕсли;
		
	Иначе
		НадписьДатаСинхронизации = "";
		
		Если ДатаПоследнейСинхронизацииКонтактов = ДатаПоследнейСинхронизацииСобытий Тогда
			НадписьДатаСинхронизации = НСтр("ru = 'Дата последнего сеанса обмена:'") + " " + Строка(ДатаПоследнейСинхронизацииКонтактов)
		Иначе
			Если ЗначениеЗаполнено(ДатаПоследнейСинхронизацииКонтактов) Тогда
				НадписьДатаСинхронизации = НСтр("ru = 'Дата последней синхронизации контактов:'") + " " + Строка(ДатаПоследнейСинхронизацииКонтактов);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДатаПоследнейСинхронизацииСобытий) Тогда
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + ?(ЗначениеЗаполнено(НадписьДатаСинхронизации), Символы.ПС, "");
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + НСтр("ru = 'Дата последней синхронизации мероприятий:'") + " " + Строка(ДатаПоследнейСинхронизацииСобытий);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДатаПоследнейСинхронизацииПисем) Тогда
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + ?(ЗначениеЗаполнено(НадписьДатаСинхронизации), Символы.ПС, "");
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + НСтр("ru = 'Дата последней синхронизации писем:'") + " " + Строка(ДатаПоследнейСинхронизацииПисем);
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Элементы.НадписьДатаСинхронизации.Заголовок = НадписьДатаСинхронизации;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИмяКомпьютераСформироватьНаименование()
	
	Объект.Компьютер = ИмяКомпьютера();
	Объект.Наименование = Строка(Объект.Пользователь) +" (" + Строка(Объект.Компьютер) + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		#Если НЕ Вебклиент Тогда
			Объект.Компьютер = ИмяКомпьютера();
			Объект.Наименование = Строка(Объект.Пользователь) +" (" + Строка(Объект.Компьютер) + ")";
		#Иначе
			ПолучитьИмяКомпьютераСформироватьНаименование();
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры
